docs/providers/pia-ndc-samples/PIA-NDC/doAirShopping_2A1C1I_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.iata.org/IATA/2015/00/2020.1/IATA_AirShoppingRQ">
   <soapenv:Header/>
   <soapenv:Body>
      <IATA_AirShoppingRQ>
         <MessageDoc>
            <Name>NDC GATEWAY</Name>
            <RefVersionNumber>20.1</RefVersionNumber>
         </MessageDoc>
         <Party>
            <Sender>
               <TravelAgency>
                  <AgencyID>SELENS</AgencyID>
               </TravelAgency>
            </Sender>
         </Party>
         <Request>
            <FlightRequest>
               <OriginDestCriteria>
                  <DestArrivalCriteria>
                     <IATA_LocationCode>ISB</IATA_LocationCode>
                  </DestArrivalCriteria>
                  <OriginDepCriteria>
                     <Date>2025-05-28</Date>
                     <IATA_LocationCode>KHI</IATA_LocationCode>
                  </OriginDepCriteria>
                  <PreferredCabinType>
                     <CabinTypeCode>Y</CabinTypeCode>
                  </PreferredCabinType>
               </OriginDestCriteria>
            </FlightRequest>
            <Paxs>
               <Pax>
                  <PaxID>SH1</PaxID>
                  <PTC>ADT</PTC>
               </Pax>
               <Pax>
                  <PaxID>SH2</PaxID>
                  <PTC>ADT</PTC>
               </Pax>
               <Pax>
                  <PaxID>SH3</PaxID>
                  <PTC>CHD</PTC>
               </Pax>
               <Pax>
                  <PaxID>SH4</PaxID>
                  <PTC>INF</PTC>
               </Pax>
            </Paxs>
            <ResponseParameters>
               <CurParameter>
                  <RequestedCurCode>PKR</RequestedCurCode>
               </CurParameter>
               <LangUsage>
                  <LangCode>EN</LangCode>
               </LangUsage>
            </ResponseParameters>
         </Request>
      </IATA_AirShoppingRQ>
   </soapenv:Body>
</soapenv:Envelope>